controllers/SuryaController.php

INSERT INTO `surya` (`firstname`, `lastname`, `phone`, `email`) VALUES ('Tom', 'Shell', 2147483647, 'tom@yahoo.com')
---
    public function actionCreate()
    {
        $model = new Surya();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {